Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: When using Repositories, you can get the exact same convenient methods as wit the active record pattern, injected in your Repository, by making them implements `PanacheMongoRepository`:
zh_cn: 当使用 Repositories 时，你可以得到与主动记录模式完全相同的方便方法，注入到你的 Repository 中，通过使它们实现 `PanacheMongoRepository` 接口 ：

source: When using Repositories, you get the exact same convenient methods as with the active record pattern, injected in your Repository, by making them implement `PanacheMongoRepository`:
zh_cn: 当使用 Repositories 时，你可以得到与活动记录模式完全相同的方便方法，注入到你的 Repository 中，通过它们实现 `PanacheMongoRepository` 。

source: When using Repositories, you get the exact same convenient methods as with the active record pattern, injected in your Repository, by making them implements `PanacheRepository`:
zh_cn: 使用 Repository 模式时，通过实现 `PanacheRepository` 接口，你可以使用与Active Record模式下完全相同的便捷方法：

source: When using SmallRye Reactive Messaging with Kafka (`io.quarkus:quarkus-smallrye-reactive-messaging-kafka`), Quarkus can often automatically detect the correct serializer and deserializer class. This autodetection is based on declarations of `@Incoming` and `@Outgoing` methods, as well as injected ``@Channel``s.
zh_cn: 当使用SmallRye Reactive Messaging with Kafka ( `io.quarkus:quarkus-smallrye-reactive-messaging-kafka` )时，Quarkus通常可以自动检测可用的序列化器和反序列化器类。这种自动检测是基于 `@Incoming` 和 `@Outgoing` 方法的声明，以及注入的 `@Channel` 。

source: When using `@ApplicationScoped`, you will get a single instance for your verticle. Having multiple instances of verticles can be helpful to share the load among them. Each of them will be associated with a different I/O thread (Vert.x event loop).
zh_cn: 当使用 `@ApplicationScoped` ，你将为你的verticle获得一个实例。拥有多个verticles的实例可以帮助他们分担负载。它们中的每一个都将与不同的I/O线程相关联（Vert.x事件循环）。

source: When using `@Blocking`, it ignores the value of the `blocking` attribute of `@ConsumeEvent`.
zh_cn: 当使用 `@Blocking` ，它忽略了 `blocking` 属性的值 `@ConsumeEvent` 。

source: When using `ObjectId`, MongoDB will automatically provide a value for you, but if you use a custom field type, you need to provide the value by yourself.
zh_cn: 当使用 `ObjectId` ，MongoDB会自动为你提供一个值，但如果你使用一个自定义字段类型，你需要自己提供一个值。

source: When using a local GraalVM installation, the native executable targets your local operating system (Linux, macOS, Windows etc). However, as a container may not use the same _executable_ format as the one produced by your operating system, we will instruct the Maven build to produce an executable by leveraging a container runtime (as described in <<#container-runtime,this section>>):
zh_cn: 使用本地GraalVM安装时，原生可执行文件的目标是您的本地操作系统（Linux、macOS、Windows等）。然而，由于容器可能不使用与操作系统相同的 _executable_ 格式，我们将指示Maven构建通过利用容器运行时（ 如 <<#container-runtime,this section>> 所述）来生成可执行文件：

source: When using exactly-once processing, consumed message offset commits are handled by the transaction and therefore the application should not commit offsets through other means. The consumer should have `enable.auto.commit=false` (the default) and set explicitly `commit-strategy=ignore`:
zh_cn: 当使用（exactly-once）精确一次处理时，消耗的消息偏移量提交由事务处理，因此应用程序不应通过其他方式提交偏移量。 消费者应该有 `enable.auto.commit=false` （默认）并明确设置 `commit-strategy=ignore` ：

source: When using multiple clients, each `MongoClient`, you can select the client to inject using the `io.quarkus.mongodb.MongoClientName` qualifier. Using the above properties to configure three different clients, you can also inject each one as follows:
zh_cn: 当使用多个客户端时，每个 `MongoClient` ，你可以使用 `io.quarkus.mongodb.MongoClientName` 修饰语选择要注入的客户端。使用上述属性来配置三个不同的客户端，你也可以按以下方式来注入每个客户端：

source: When using multiple clients, you can select the client to inject using the `io.quarkus.redis.client.RedisClientName` qualifier. Using the above properties to configure three different clients, you can also inject each one as follows:
zh_cn: 当使用多个客户端时，可以使用 `io.quarkus.redis.client.RedisClientName` 注解，来选择要注入的客户端。使用上述属性来配置三个不同的客户端后，可以按以下方式来注入每个客户端：

source: When using native executables with GraalVM, all classes that will be used with reflection need to be registered. The good news is that Quarkus does that work for you most of the time. So far, we haven't registered any class, not even `Fruit`, for reflection usage and everything is working fine.
zh_cn: 当使用GraalVM的本地可执行文件时，需要注册所有将与反射一起使用的类。好消息是，Quarkus在大多数时候都会为你做这项工作。到目前为止，我们还没有注册任何类，甚至没有注册 `Fruit` ，并且一切正常。

source: When using native-image, the use of http (or https) protocol(s) must be declared
zh_cn: 当使用native-image时，必须声明使用http（或https）协议

source: When using the SmallRye Reactive Messaging extension for Kafka, we are able to propagate the span into the Kafka Record with:
zh_cn: 当使用 SmallRye Reactive Messaging 的 Kafka 扩展时，我们可以向Kafka记录中传播span，通过：

source: When using the `quarkus-kafka-client` extension, you can enable _readiness_ health check by setting the `quarkus.kafka.health.enabled` property to `true` in your `application.properties`. This check reports the status of the interaction with a _default_ Kafka broker (configured using `kafka.bootstrap.servers`). It requires an _admin connection_ with the Kafka broker, and it is disabled by default. If enabled, when you access the `/q/health/ready` endpoint of your application, you will have information about the connection validation status.
zh_cn: 当使用 `quarkus-kafka-client` 扩展时，您可以通过在您的 `application.properties` 配置文件中将 `quarkus.kafka.health.enabled` 属性设置为 `true` 来启用 _就绪_ 健康检查。该检查会报告与 _默认的_ Kafka Broker(使用 `kafka.bootstrap.servers` 配置)的交互状态。它需要一个与Kafka Broker的 _管理员连接_ ，并且默认是禁用的。如果启用，当您访问您应用程序的 `/q/health/ready` 节点时，您将获得关于连接验证状态的信息。

source: When using the repository pattern, you can define your entities as regular JPA entities.
zh_cn: 使用Repository模式时，可以将实体类定义为普通的JPA实体。

source: When using the repository pattern, you can define your entities as regular POJO.
zh_cn: 当使用存储库模式时，你可以将你的实体定义为普通的POJO。

source: When working with the `quarkus-kubernetes` extension and have Kotlin classes bound to CustomResource definitions (like you do for building operators), you need to be aware that the underlying Fabric8 Kubernetes Client uses its own static Jackson `ObjectMapper` s, which can be configured as follows with the `KotlinModule`:
zh_cn: 当使用 `quarkus-kubernetes` 扩展并让Kotlin类绑定到CustomResource定义时（就像您在构建operator时一样），您需要注意底层的Fabric8 Kubernetes客户端使用它自己的静态Jackson `ObjectMapper` 对象，您可以这样为其配置 `KotlinModule` ：

source: When you have multiple connectors, you would need to indicate which connector you want to use in the application configuration.
zh_cn: 当你有多个连接器时，你需要在应用程序配置中指出你想要使用哪个连接器。

source: When you invoke an HTTP request on the API Gateway, the Gateway turns that HTTP request into a JSON event document that is forwarded to a Quarkus Lambda. The Quarkus Lambda parses this json and converts in into an internal representation of an HTTP request that can be consumed by any HTTP framework Quarkus supports (JAX-RS, servlet, Reactive Routes).
zh_cn: 当你在API网关上调用一个HTTP请求时，网关会把这个HTTP请求转换成一个JSON事件文档，并转发给Quarkus Lambda。Quarkus Lambda解析这个json，并将其转换为HTTP请求的内部表示，这样它就可以被Quarkus支持的任何HTTP框架（JAX-RS、servlet、Reactive Routes）所消费。

source: When you now execute an HTTP GET request against `http://localhost:8080/hello`, you should see a JSON message with the value `hi` as its `message` field.
zh_cn: 当您现在执行一个对 `http://localhost:8080/hello` 的HTTP GET请求时，您应该会看到一个JSON消息，其 `message` 字段的值是 `hi` 。

source: When you use query parameters, be careful that PanacheQL queries will refer to the Object parameters name but native queries will refer to MongoDB field names.
zh_cn: 当你使用查询参数时，要注意PanacheQL查询将参考Object参数名称，但本地查询将参考MongoDB字段名称。

source: When you're done playing with the `dev` mode" you can run it as a standard Java application.
zh_cn: 当您尝试完毕 `开发` 模式后，您可以把它作为一个标准的Java应用程序运行。

source: Where can I get it?
zh_cn: 我在哪儿能获得到?

source: Whether AMQP subscription is durable Type: _boolean_
zh_cn: AMQP订阅是否是durable 类型: _boolean_

source: Whether OpenTelemetry is enabled or not. The default is `true`, but shown here to indicate how it can be disabled
zh_cn: OpenTelemetry是否已启用。默认是 `true` ，但放在这里是用来展示如何禁用它

source: Whether health reporting is enabled (default) or disabled Type: _boolean_
zh_cn: 健康报告是否被启用（默认启用）或禁用 类型: _boolean_

source: Whether or not a graceful shutdown should be attempted when the application terminates. Type: _boolean_
zh_cn: 当应用程序终止时，是否应该尝试平滑关闭。 类型: _boolean_

source: Whether or not the connection to the broker is re-attempted in case of failure Type: _boolean_
zh_cn: 在失败的情况下，是否重新尝试与broker的连接 类型: _boolean_

source: Whether or not the connector should insert automatically the `time` attribute into the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `time` attribute itself Type: _boolean_
zh_cn: 连接器是否应将 `time` 属性自动添加到发出的云事件中。要求 `cloud-events` 被设置为 `true` 。如果消息本身没有配置 `time` 属性，则使用此值 类型: _boolean_

source: Whether readiness health reporting is enabled (default) or disabled Type: _boolean_
zh_cn: 是否启用（默认启用）或禁用就绪情况报告 类型: _boolean_

source: Whether sent AMQP messages are marked durable Type: _boolean_
zh_cn: 发送的AMQP消息是否被标记为durable 类型: _boolean_

source: Whether the AMQP connection uses SSL/TLS Type: _boolean_
zh_cn: AMQP连接是否使用了SSL/TLS 类型: _boolean_

source: Whether the Kafka records are consumed in batch. The channel injection point must consume a compatible type, such as `List<Payload>` or `KafkaRecordBatch<Payload>`. Type: _boolean_
zh_cn: 是否启用Kafka记录的批处理。通道的注入点必须消费一个兼容的类型，例如 `List<Payload>` 或 `KafkaRecordBatch<Payload>`. 类型: _boolean_

source: Whether the client waits for Kafka to acknowledge the written record before acknowledging the message Type: _boolean_
zh_cn: 在确认消息之前，客户端是否会等待Kafka确认写入的记录 类型: _boolean_

source: Whether the connector should allow multiple upstreams Type: _boolean_
zh_cn: 连接器是否应允许多个上游 类型: _boolean_

source: Whether the connector should insert automatically the `time` attribute into the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `time` attribute itself Type: _boolean_
zh_cn: 连接器是否应将 `time` 属性自动插入到传出的云事件中。要求将 `cloud-events` 设为 `true` 。如果消息本身没有配置 `time` 属性，则使用此值 类型: _boolean_

source: Whether the connector should use an anonymous sender. Default value is `true` if the broker supports it, `false` otherwise. If not supported, it is not possible to dynamically change the destination address. Type: _boolean_
zh_cn: 连接器是否应使用匿名发送者。如果代理支持，则默认值为 `true` ，否则为 `false` 。如果不支持，则无法动态更改目的地地址。 类型: _boolean_

source: Whether the polling must be paused when the application does not request items and resume when it does. This allows implementing back-pressure based on the application capacity. Note that polling is not stopped, but will not retrieve any records when paused. Type: _boolean_
zh_cn: 当应用程序不请求记录时，轮询是否必须被暂停，或应用程序开始请求记录时轮询是否要恢复。该属性允许实现基于应用容量的背压。需要注意轮询不会停止，但当暂停时不会获取任何记录。 类型: _boolean_

source: Whether the received AMQP messages must be acknowledged when received Type: _boolean_
zh_cn: 收到的AMQP消息是否必须在收到时被确认 类型: _boolean_

source: Whether the received AMQP messages must be dispatched to multiple _subscribers_ Type: _boolean_
zh_cn: 收到的AMQP消息是否必须派发给多个 _subscribers_ 类型: _boolean_

source: Whether the startup and readiness check should verify that topics exist on the broker. Default to false. Enabling it requires an admin client connection. Type: _boolean_
zh_cn: 启动和就绪检查是否要验证broker上存在主题。默认为false。启用它需要一个管理员客户端连接。 类型: _boolean_

source: Whether tracing is enabled (default) or disabled Type: _boolean_
zh_cn: 是否启用（默认启用）或禁用tracing 类型: _boolean_

source: While Quarkus will listen on port `8080` by default, when running tests it defaults to `8081`. This allows you to run tests while having the application running in parallel.
zh_cn: 虽然Quarkus默认会监听端口 `8080` ，但当运行测试时，它会默认设为 `8081` 。这允许您在运行测试的同时让应用程序并行运行。

source: While a normal message emitter would support concurrent calls to `send` methods and consequently queues outgoing messages to be written to Kafka, a `KafkaTransactions` emitter only supports one transaction at a time. A transaction is considered in progress from the call to the `withTransaction` until the returned `Uni` results in success or failure. While a transaction is in progress, subsequent calls to the `withTransaction`, including nested ones inside the given function, will throw `IllegalStateException`.
zh_cn: 虽然普通的消息emitter支持并发调用 `send` 方法并将要写入 Kafka 的传出消息顺序排队，但 `KafkaTransactions` emitter每次只支持一个事务。 从调用 `withTransaction` 直到返回的 `Uni` 导致成功或失败，事务被视为正在进行中。 当事务正在进行时，对 `withTransaction` 的后续调用，包括给定函数内的嵌套调用，都将抛出 `IllegalStateException` 。

source: While named "reactive", RESTEasy Reactive supports equally well both traditional blocking patterns and reactive patterns.
zh_cn: 虽然名为 "响应式"，但RESTEasy Reactive同样支持传统的阻塞模式和响应式模式。

source: While running in Quarkus Dev Mode, you can feed events to it by doing an HTTP POST to `http://localhost:8080`. The mock event server will receive the events and your lambda will be invoked. You can perform live coding on your lambda and changes will automatically be recompiled and available the next invocation you make. Here's an example:
zh_cn: 当在Quarkus开发模式下运行时，你可以对 `<a href="http://localhost:8080" class="bare">http://localhost:8080</a>` 执行HTTP POST来向它提供事件。模拟事件服务器将接收事件，你的lambda将被调用。你可以在你的lambda上执行实时编码，所做的修改将自动被重新编译，并在下次调用时可用。下面是一个例子：

source: While users are encouraged to use xref:scheduler.adoc#standard-scheduling[regular Quarkus scheduler], Quarkus provides a compatibility layer for Spring Scheduled in the form of the `spring-scheduled` extension.
zh_cn: 虽然我们鼓励用户使用 link:scheduler.html#standard-scheduling[常规 Quarkus调度器] ，但Quarkus以 `spring-scheduled` 扩展的形式为Spring Scheduled提供了一个兼容层。

source: While using the `throttled` commit-strategy, specify the max age in milliseconds that an unprocessed message can be before the connector is marked as unhealthy. Setting this attribute to 0 disables this monitoring. Type: _int_
zh_cn: 在使用 `throttled` 提交策略时，指定未处理的消息在连接器被标记为不健康之前的可存续的最大时间（毫秒）。将此属性设置为0可以禁用该监控。 类型: _int_

source: While we recommend you to follow the step-by-step instructions, you can find the final solution on https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-reactive-panache-quickstart.
zh_cn: 虽然我们建议您按照步骤操作，但您可以在 https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-reactive-panache-quickstart上找到最终的解决方案。

source: While writing native application you'll need to define proxy classes at image build time by specifying the list of interfaces that they implement.
zh_cn: 在编写本地应用程序时，你需要在构建时通过指定它们的实现接口列表来定义代理类。

source: While you are encouraged to use CDI annotations for injection, Quarkus provides a compatibility layer for Spring dependency injection in the form of the spring-di extension.
zh_cn: 虽然我们鼓励你使用CDI注解进行注入，但Quarkus以spring-di扩展的形式为Spring依赖注入提供了一个兼容层。

source: While you are encouraged to use Hibernate ORM with Panache for your data layer, Quarkus provides a compatibility layer for Spring Data JPA in the form of the spring-data-jpa extension.
zh_cn: 虽然我们鼓励你使用Hibernate ORM与Panache作为你的数据层，但Quarkus以spring-data-jpa扩展的形式为Spring Data JPA提供了一个兼容层。

source: While you are encouraged to use JAX-RS annotations for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the spring-web extension.
zh_cn: 虽然我们鼓励你使用JAX-RS注解来定义REST端点，但Quarkus以spring-web扩展的形式为Spring Web提供了一个兼容层。

source: While you are encouraged to use the Cache extension for your application-level caching, Quarkus provides a compatibility layer for Spring Cache in the form of the spring-cache extension.
zh_cn: 虽然我们鼓励你使用Cache扩展来进行应用级缓存，但Quarkus以spring-cache扩展的形式为Spring Cache提供了一个兼容层。

source: While you are encouraged to use the Quarkus security layer to secure your applications, Quarkus provides a compatibility layer for Spring Security in the form of the spring-security extension.
zh_cn: 虽然我们鼓励你使用Quarkus安全层来保护你的应用程序，但Quarkus以spring-security扩展的形式为Spring Security提供了一个兼容层。

source: While you are encouraged to use the Scheduler or Quartz extensions to schedule tasks, Quarkus provides a compatibility layer for Spring Scheduled in the form of the spring-scheduled extension.
zh_cn: 虽然我们鼓励你使用Scheduler或Quartz扩展来安排任务，但Quarkus以spring-scheduled扩展的形式为Spring Scheduled提供了一个兼容层。

source: While you are in your build file, add the following dependency:
zh_cn: 在你的构建文件中，添加以下依赖项:

source: While you can use the Vert.x API to register consumers, Quarkus comes with declarative support. To consume events, use the `io.quarkus.vertx.ConsumeEvent` annotation:
zh_cn: 虽然你可以使用Vert.x的API来注册消费者，但Quarkus带有声明性支持。要消费事件，请使用 `io.quarkus.vertx.ConsumeEvent` 注解。

source: Why always having a transaction manager?
zh_cn: 为什么总是有一个事务处理器？

source: Why do you prefer JTA vs Hibernate's transaction management API
zh_cn: 为什么相对Hibernate 的事务管理 API你更推荐JTA

source: Why follow this process
zh_cn: 为什么要遵循这个过程

source: Will the Quarkus team accept my extension?
zh_cn: Quarkus团队会接受我的扩展吗？

source: With <a href="https://code.quarkus.io/">code.quarkus.io</a>, in a few clicks, you can bootstrap your Quarkus application and discover its extension ecosystem.
zh_cn: 点击 <a href="https://code.quarkus.io/">code.quarkus.io</a>链接, 只需几次单击就可以引导您的Quarkus应用程序并发现其扩展生态系统。

source: With Funqy, a function is just:
zh_cn: Funqy函数就像是这样：

source: With JSON serialization correctly configured, you can also use `Publisher<Fruit>` and `Emitter<Fruit>`.
zh_cn: 在正确配置了JSON序列化后，您也可以使用 `Publisher<Fruit>` 和 `Emitter<Fruit>` 。

source: With Panache, the <code>Element</code> class would be as simple as:
zh_cn: 有了Panache，<code>Element</code>类就会像这样简单：

source: With Panache, we took an opinionated approach to tackle all these problems:
zh_cn: 通过Panache，我们采取了一种有主见的方法来解决所有这些问题：

source: With Quarkus you can deploy your favorite Java HTTP frameworks as Amazon Lambda's using either the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] or https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]. This means that you can deploy your microservices written with RESTEasy Reactive (JAX-RS), Undertow (servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] or any other Quarkus HTTP framework as an AWS Lambda.
zh_cn: 通过Quarkus，您可以使用 link:https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] 或 link:https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API] 将您喜欢的Java HTTP框架部署为Amazon Lambda。这意味着你可以将用RESTEasy Reactive（JAX-RS）、Undertow（servlet）、Reactive Routes、 link:funqy-http.html[Funqy HTTP] 或任何其他Quarkus HTTP框架编写的微服务部署为AWS Lambda。

source: With Quarkus, there is no need to create an `Application` class. It's supported, but not required. In addition, only one instance of the resource is created and not one per request. You can configure this using the different `*Scoped` annotations (`ApplicationScoped`, `RequestScoped`, etc).
zh_cn: 使用Quarkus，不需要创建一个 `Application` 类。它支持这么做，但不是必须的。此外，只有一个资源的实例被创建，而不是每个请求一个。你可以使用不同的 `*Scoped` 注解（ `ApplicationScoped` , `RequestScoped` , 等等）来配置。

source: With Quarkus, you can easily configure a datasource, or several if need be.
zh_cn: 使用Quarkus，你可以很容易地配置一个数据源，如果需要的话，也可以配置若干个。

source: With `quarkus.flyway.migrate-at-start=true`, as in the example above, Quarkus will execute the Flyway migration as part of the xref:lifecycle.adoc[application startup].
zh_cn: 如上例所述，通过设置 `quarkus.flyway.migrate-at-start=true` Quarkus将在 xref:lifecycle.adoc[应用启动] 的时候通过Flyway进行迁移。

source: With in-memory channels we were able to test application code processing messages without starting a Kafka broker. Note that different in-memory channels are independent, and switching channel connector to in-memory does not simulate message delivery between channels configured to the same Kafka topic.
zh_cn: 有了内存 channels ，我们就可以测试应用程序代码的消息方法，而无需启动Kafka broker。请注意，不同的内存 channel 是独立的，将 channel 连接器切换到内存中并不能模拟配置到同一Kafka topic的 channel 之间的消息传递。

source: With injected JWT parser
zh_cn: 使用注入的JWT Parser

source: With minimal integration, it is possible to leverage the AWS Java SDK v2, which can be used to invoke services such as SQS, SNS, S3 and DynamoDB.
zh_cn: 通过最小的整合，可以利用AWS Java SDK v2，其可以用来调用诸如SQS、SNS、S3和DynamoDB等服务。

source: With the OpenTelemetry Collector, Jaeger system and application running, you can make a request to the provided endpoint:
zh_cn: 在OpenTelemetry Collector、Jaeger系统和应用程序运行的情况下，您可以向指定的节点发出请求：

source: With the `Emitter` API, you can also encapsulate the outgoing payload inside `Message<T>`. As with the previous examples, `Message` lets you handle the ack/nack cases differently.
zh_cn: 通过 `Emitter` API，您也可以将要发送的payload封装在 `Message<T>` 中 。与前面的例子一样， `Message` 让您以不同的方式处理确认/拒绝(ack/nack)的情况。

source: With the active record pattern: put all your entity logic in static methods in your entity class and don't create DAOs. Your entity superclass comes with lots of super useful static methods, and you can add your own in your entity class. Users can just start using your entity `Person` by typing `Person.` and getting completion for all the operations in a single place.
zh_cn: 使用活动记录模式：把你所有的实体逻辑放在实体类的静态方法中，不要创建DAO。你的实体超类带有很多超级有用的静态方法，你也可以在你的实体类中添加你自己的静态方法。用户可以通过输入 `Person.` ，开始使用你的实体 `Person` ，并在一个地方获得所有操作的完成。

source: With the aforementioned example in your `application.properties`, your Hibernate ORM managed database will be populated with test data both during the JVM mode test run and during the native mode test run. The production executable will contain only the `version.txt` resource, no superfluous test data.
zh_cn: 在前面提到的 `application.properties` 例子中。在JVM模式测试运行期间和原生模式测试运行期间，Hibernate ORM管理的数据库将填充测试数据。生产可执行文件将只包含 `version.txt` 资源，没有多余的测试数据。

source: With the event bus, you send _messages_ to _virtual addresses_. The event bus offers three types of delivery mechanisms:
zh_cn: 通过事件总线，你可以向 _virtual addresses_ 发送 _messages_。事件总线提供三种类型的传递机制：

source: With these changes in place the `/hello` endpoint will reply with a JSON object instead of a simple String.
zh_cn: 经过这些更改， `/hello` 端点将用一个JSON对象而不是一个简单的字符串来响应请求。

source: With this extension, you can retrieve the managed instance of Vert.x using either field or constructor injection:
zh_cn: 通过这个扩展，你可以使用字段或构造函数注入检索Vert.x的托管实例：

source: With this in mind, let's see how we can develop a CRUD application with Quarkus, which will use the I/O thread to handle the HTTP requests, interact with a database, process the result, and write the HTTP response; in other words: a reactive CRUD application.
zh_cn: 考虑到这一点，让我们看看如何使用Quarkus开发一个CRUD应用程序，它将使用I/O线程处理HTTP请求，与数据库交互，处理结果，并编写HTTP响应，换句话说：一个响应式CRUD应用程序。

source: With this in place, every HTTP request on `/bus/quarkus` sends a message to the event bus, waits for a reply, and when this one arrives, writes the HTTP response:
zh_cn: 有了这个， `/bus/quarkus` 上的每个HTTP请求都会向事件总线发送一个消息，等待回复，当这个回复到来时，就会写入HTTP响应：

source: With this, we can start implementing the endpoints.
zh_cn: 有了这些，我们就可以开始实现端点了。

source: Without configuration, Flyway is set up for every datasource using the default settings.
zh_cn: 在没有配置的情况下，Flyway对每个数据源都是使用默认设置。

source: Wizards w/code.quarkus.io
zh_cn: 向导 code.quarkus.io

source: Working with HashiCorp Vault’s Authentication
zh_cn: 与HashiCorp Vault的认证合作

source: Working with Kotlin Data classes
zh_cn: 使用Kotlin Data classes工作

source: Working with multi-module project or external modules
zh_cn: 与多模块项目或外部模块一起工作

source: Works with Quarkus 1.1.1
zh_cn: 适用于 Quarkus 1.1.1

source: World Tour
zh_cn: 世界巡演

source: World Tour - Abstracts and Support materials.
zh_cn: 世界巡回-摘要和支持材料。

source: World Tour - Sound Check... Getting Started with Quarkus.
zh_cn: 世界巡回-试音…从Quarkus开始。

source: Write Acknowledgement
zh_cn: 写确认

source: Write New Extensions
zh_cn: 编写新的扩展程序

source: Write QuickStart Guides
zh_cn: 编写快速入门指南

source: Writing Extensions
zh_cn: 编写扩展

source: Writing JSON REST Services
zh_cn: 编写JSON REST服务

source: Writing Native Applications
zh_cn: 编写原生应用程序

source: Writing REST JSON Services
zh_cn: 编写REST JSON服务
